qemu/qemu/hw/arm/stm32_adc.c
/* --- ADC_JDRx, ADC_DR values --------------------------------------------- */

#define ADC_JDATA_LSB			0
#define ADC_DATA_LSB			0
#define ADC_ADC2DATA_LSB		16 /* ADC1 only (dual mode) */
#define ADC_JDATA_MSK			(0xffff << ADC_JDATA_LSB)
#define ADC_DATA_MSK			(0xffff << ADC_DA)
#define ADC_ADC2DATA_MSK		(0xffff << ADC_ADC2DATA_LSB)
					/* ADC1 only (dual mode) */

/** Timer 1 Trigger Output */
#define ADC_CR2_JEXTSEL_TIM1_TRGO       (0x0 << 12)
/** Timer 1 Compare Output 4 */
#define ADC_CR2_JEXTSEL_TIM1_CC4        (0x1 << 12)
/** Timer 4 Compare Output 3 */
#define ADC_CR2_JEXTSEL_TIM4_CC3        (0x2 << 12)
/** Timer 8 Compare Output 2 */
#define ADC_CR2_JEXTSEL_TIM8_CC2        (0x3 << 12)
/** Timer 8 Compare Output 4 */
#define ADC_CR2_JEXTSEL_TIM8_CC4        (0x4 << 12)
/** Timer 5 Trigger Output */
#define ADC_CR2_JEXTSEL_TIM5_TRGO       (0x5 << 12)
/** Timer 5 Compare Output 4 */
#define ADC_CR2_JEXTSEL_TIM5_CC4        (0x6 << 12)
/** Injected Software Trigger */
#define ADC_CR2_JEXTSEL_JSWSTART        (0x7 << 12) /* Software start. */
/**@}*/

#define ADC_CR2_JEXTSEL_MASK            (0x7 << 12)
#define ADC_CR2_JEXTSEL_SHIFT           12

/* ALIGN: Data alignment. */
#define ADC_CR2_ALIGN_RIGHT             (0 << 11)
#define ADC_CR2_ALIGN_LEFT              (1 << 11)
#define ADC_CR2_ALIGN                   (1 << 11)

/* Note: Bits [10:9] are reserved and must be kept at reset value. */

/* DMA: Direct memory access mode. (ADC1 and ADC3 only!) */
#define ADC_CR2_DMA                     (1 << 8)
/* RSTCAL: Reset calibration. */
#define ADC_CR2_RSTCAL                  (1 << 3)

/* CAL: A/D Calibration. */
#define ADC_CR2_CAL                     (1 << 2)

/* CONT: Continous conversion. */
#define ADC_CR2_CONT                    (1 << 1)

/* ADON: A/D converter On/Off. */
/* Note: If any other bit in this register apart from ADON is changed at the
 * same time, then conversion is not triggered. This is to prevent triggering
 * an erroneous conversion.
 * Conclusion: Must be separately written.
 */
#define ADC_CR2_ADON                    (1 << 0)

/* --- Function prototypes ------------------------------------------------- */

struct Stm32Adc {
    /* Inherited */
    SysBusDevice busdev;

    /* Properties */
    stm32_periph_t periph;
    void *stm32_rcc_prop;
    void *stm32_gpio_prop;
    void *stm32_afio_prop;

    /* Private */
    MemoryRegion iomem;

    Stm32Rcc *stm32_rcc;
    Stm32Gpio **stm32_gpio;
    uint64_t ns_per_sample[8]; /*8 possibility of numbers cycles for each conversion 
                                (recover from: time register 1 (SMPR1),time register 2 (SMPR2))*/

    /* Register Values */
    uint32_t
	 ADC_SR,
	 ADC_CR1,
	 ADC_CR2,
	 ADC_SMPR1,
	 ADC_SMPR2,
	 ADC_JOFR1,
	 ADC_JOFR2,
	 ADC_JOFR3,
	 ADC_JOFR4,
	 ADC_HTR,
	 ADC_LTR,
	 ADC_SQR1,
	 ADC_SQR2,
	 ADC_SQR3,
	 ADC_JSQR,
	 ADC_JDR1,
	 ADC_JDR2,
	 ADC_JDR3,
	 ADC_JDR4,
	 ADC_DR;
        

    bool sr_read_since_ore_set;

    bool converting;

    struct QEMUTimer *conv_timer;

    CharDriverState *chr;

    uint32_t afio_board_map;

    qemu_irq irq;
    int curr_irq_level;
    int Vref; //mv
    int Vdda; //mv
};
/* functions added to adc*/ 
static void stm32_ADC_GPIO_check(Stm32Adc *s,int channel);
static void stm32_ADC_update_ns_per_sample(Stm32Adc* s);
static uint64_t stm32_ADC_get_nbr_cycle_per_sample(Stm32Adc* s,int channel);
static int stm32_ADC_get_channel_number(Stm32Adc* s,int convert_number);
static void stm32_ADC_SR_write(Stm32Adc *s, uint32_t new_value);
static void stm32_ADC_SQR1_write(Stm32Adc *s,uint32_t new_value);
static void stm32_ADC_CR2_write(Stm32Adc *s,uint32_t new_value);
static uint32_t stm32_ADC_DR_read(Stm32Adc *s);

/* functions modified in adc*/ 
static void stm32_adc_clk_irq_handler(void *opaque, int n, int level);
static void stm32_ADC_update_irq(Stm32Adc *s);
static void stm32_adc_start_conv(Stm32Adc *s);
static void stm32_adc_reset(DeviceState *dev);

/* HELPER FUNCTIONS */

/* Handle a change in the peripheral clock. */
static void stm32_adc_clk_irq_handler(void *opaque, int n, int level)
{

    Stm32Adc *s = (Stm32Adc *)opaque;
    assert(n == 0);

    /* Only update the ns per sample if the IRQ is being set. */
    if(level) {
        stm32_ADC_update_ns_per_sample(s);
    }

}


/* Routine which updates the ADC IRQ.  This should be called whenever
 * an interrupt-related flag is updated.
 */
static void stm32_ADC_update_irq(Stm32Adc *s) {
    int new_irq_level = 
        ((s->ADC_CR1 >> 5) & (s->ADC_SR >> 1)) | 
        ((s->ADC_CR1 >> 7) & (s->ADC_SR >> 2)) |
        ((s->ADC_CR1 >> 6) & (s->ADC_SR >> 0));
       
    /* Only trigger an interrupt if the IRQ level changes.  We probably could
     * set the level regardless, but we will just check for good measure.
     */
     
    if((new_irq_level & 1) ^ s->curr_irq_level ) {
        qemu_set_irq(s->irq, new_irq_level);
        s->curr_irq_level = new_irq_level;
    }
}

static void stm32_adc_conv_complete(Stm32Adc *s)
{
  s-> ADC_SR|=ADC_SR_EOC;  // jmf : indicates end of conversion
  stm32_ADC_update_irq(s); 
}


static void stm32_adc_start_conv(Stm32Adc *s)
{
    uint64_t curr_time = qemu_clock_get_ns(QEMU_CLOCK_VIRTUAL);
    int channel_number=stm32_ADC_get_channel_number(s,1);
    // Write result of conversion
      if(channel_number==16){
      s->Vdda=rand()%(1200+1) + 2400; //Vdda belongs to the interval [2400 3600] mv
      s->Vref=rand()%(s->Vdda-2400+1) + 2400; //Vref belongs to the interval [2400 Vdda] mv
      s->ADC_DR= s->Vdda - s->Vref; 
      }
      else if(channel_number==17){
      s->ADC_DR= (s->Vref=rand()%(s->Vdda-2400+1) + 2400); //Vref [2400 Vdda] mv
      }
      else{
      s->ADC_DR=((int)(1024.*(sin(2*M_PI*qemu_clock_get_ns(QEMU_CLOCK_VIRTUAL)/1e9)+1.))&0xfff);
      }
      s->ADC_SR&=~ADC_SR_EOC;  // jmf : indicates ongoing conversion
      // calls conv_complete when expires      
      timer_mod(s->conv_timer,  curr_time + stm32_ADC_get_nbr_cycle_per_sample(s,channel_number)); 
}


