qemu/qemu/hw/arm/stm32_adc.c
/* TIMER HANDLERS */
/* When the convert delay is complete, mark the conversion as complete */
static void stm32_adc_conv_timer_expire(void *opaque) {
    Stm32Adc *s = (Stm32Adc *)opaque;
    stm32_adc_conv_complete(s);
}

/* Checks the ADC GPIO PIN Mode and Config */
static void stm32_ADC_GPIO_check(Stm32Adc *s,int channel)
{
 int ADC_periph,ADC_pin,config;
 if(channel<16){  
        if(channel<=15 && channel>=10){
        ADC_periph=STM32_GPIOC;
        ADC_pin=channel-10; //PC(0-5) IN10-IN15
        }
        else if(channel==9 || channel==8){
        ADC_periph=STM32_GPIOB;
        ADC_pin=channel-8; //PB(0-1) IN8-IN9
        }
        else{
        ADC_periph=STM32_GPIOA;
        ADC_pin=channel; //PA(0-7) IN0-IN7
        }

          
   Stm32Gpio *gpio_dev = s->stm32_gpio[STM32_GPIO_INDEX_FROM_PERIPH(ADC_periph)];
   if(stm32_gpio_get_mode_bits(gpio_dev, ADC_pin) != STM32_GPIO_MODE_IN) {
        hw_error("GPIO%c pin:%d needs to be configured as input",'A'+ADC_periph-1,ADC_pin);
    }

    config = stm32_gpio_get_config_bits(gpio_dev, ADC_pin);
    if(config != STM32_GPIO_IN_ANALOG)
        hw_error("GPIO%c pin:%d needs to be configured as Analog input",'A'+ADC_periph-1,ADC_pin);

             }

}

static int stm32_ADC_get_channel_number(Stm32Adc* s,int convert_number)
{
   assert(convert_number>=1 && convert_number<=16);

   if(convert_number>=1 && convert_number<=6)
   return( (s->ADC_SQR3 >> 5*(convert_number-1)) & 0x0000001f);

   else if(convert_number>=7 && convert_number<=12)
   return((s->ADC_SQR2 >> 5*(convert_number-7)) & 0x0000001f);

   else //(convert_number>=13 && convert_number<=16)
   return((s->ADC_SQR1 >> 5*(convert_number-13)) & 0x0000001f);

}

static uint64_t stm32_ADC_get_nbr_cycle_per_sample(Stm32Adc* s,int channel)
{
  assert(channel<=17 && channel>=0);
  int index_cycle;
       
           
  if (channel<=17 && channel>=10)
     index_cycle=(s->ADC_SMPR1 >> 3*(channel-10)) & 0x00000007; //recover index cycle from ADC sample time register 1 (SMPR1)
  else 
     index_cycle=(s->ADC_SMPR2 >> 3*channel) & 0x00000007;  //recover index cycle from ADC sample time register 2 (SMPR2)
        
  /* index_cycle(0-7) numbers of cycles correspondent 
     (1.5, 7.5, 13.5, 28.5, 41.5, 55.5, 71.5, 239.5) */  
   return s->ns_per_sample[index_cycle];
}

/* REGISTER IMPLEMENTATION */
static void stm32_ADC_SR_write(Stm32Adc *s, uint32_t new_value)
{
    /* The ADC_SR flags can be cleared, but not set. */
    if(new_value & ADC_SR_EOC)
     hw_error("Software attempted to set ADC SR_EOC bit\n");
    if(new_value & ADC_SR_JEOC)
     hw_error("Software attempted to set ADC SR_JEOC bit\n");  
    if(new_value & ADC_SR_AWD)
     hw_error("Software attempted to set ADC SR_EOC bit\n");
    if(new_value & ADC_SR_JSTRT)
     hw_error("Software attempted to set ADC SR_JSTRT bit\n");
    if(new_value & ADC_SR_STRT)
     hw_error("Software attempted to set ADC SR_STRT bit\n");
  
    s->ADC_SR= new_value & 0x0000001f;

    stm32_ADC_update_irq(s); //modification of ADC_SR requiere update of interrupt 
}

static void stm32_ADC_SQR1_write(Stm32Adc *s,uint32_t new_value)
{  
    /* check if number of conversion (ADC_SQR1[24 20]) greater than 1 */  
     if((new_value >> 20 & 0x0000000f) > 1) 
     hw_error("Mode Single conversion is only implemented\n");

     s->ADC_SQR1=new_value & 0x00ffffff;
}

static void stm32_ADC_CR2_write(Stm32Adc *s,uint32_t new_value)
{      
    s->ADC_CR2=new_value & 0x00fef90f; 
 
    if (s->ADC_CR2&ADC_CR2_SWSTART )  
    {
      if(!(s->ADC_CR2 & ADC_CR2_ADON))   //CR2_ADON should be set (for Enable ADC) before start conversion
         hw_error("Attempted to start conversion while ADC was disabled\n");

      stm32_ADC_GPIO_check(s,stm32_ADC_get_channel_number(s,1)); // check GPIO (Mode and config)  ANALOG INTPUT?  
      stm32_adc_start_conv(s); // jmf : software conv
    }
   
}

static uint32_t stm32_ADC_DR_read(Stm32Adc *s)
{
    
   /* check ADC Enable */  
   if(!(s->ADC_CR2 & ADC_CR2_ADON))
     hw_error("Attempted to read from ADC_DR while ADC was disabled\n");
  
   /* check conversion complete*/
   if(s->ADC_SR & ADC_SR_EOC)
     {           
       s->ADC_SR &=~((uint32_t)ADC_SR_EOC); //cleared SR_EOC flag by reading ADC_DR   
       stm32_ADC_update_irq(s); // (SR_EOC=0) requiere interrupt update
       return s->ADC_DR;
     }
   else
     {
       hw_error("Attempted to read ADC_DR while conversion is not complete\n");
       return 0;
     }
}



static void stm32_adc_reset(DeviceState *dev)
{
    Stm32Adc *s = STM32_ADC(dev);
    s->ADC_SR=0x00000000;
    s->ADC_CR1=0x00000000;
    s->ADC_CR2=0x00000000;
    s->ADC_SMPR1=0x00000000;
    s->ADC_SMPR2=0x00000000;
    s->ADC_JOFR1=0x00000000;
    s->ADC_JOFR2=0x00000000;
    s->ADC_JOFR3=0x00000000;
    s->ADC_JOFR4=0x00000000;
    s->ADC_HTR=0x00000000;
    s->ADC_LTR=0x00000000;
    s->ADC_SQR1=0x00000000;
    s->ADC_SQR2=0x00000000;
    s->ADC_SQR3=0x00000000;
    s->ADC_JSQR=0x00000000;
    s->ADC_JDR1=0x00000000;
    s->ADC_JDR2=0x00000000;
    s->ADC_JDR3=0x00000000;
    s->ADC_JDR4=0x00000000;
    s->ADC_DR=0x00000000;

    stm32_ADC_update_irq(s);
}

static uint64_t stm32_adc_read(void *opaque, hwaddr offset,
                          unsigned size)
{
    Stm32Adc *s = (Stm32Adc *)opaque;
    int start = (offset & 3) * 8;
    int length = size * 8;

    switch (offset & 0xfffffffc) {
        case oADC_SR : 	return (extract64(s->ADC_SR,  start, length));
        case oADC_CR1: 	return extract64(s->ADC_CR1,  start, length);
        case oADC_CR2: 	return (extract64(s->ADC_CR2, start, length)&~ADC_CR2_RSTCAL&~ADC_CR2_CAL); // jmf : calibration complete
        case oADC_SMPR1:return extract64(s->ADC_SMPR1,start, length);
        case oADC_SMPR2:return extract64(s->ADC_SMPR2,start, length);
        case oADC_JOFR1:return extract64(s->ADC_JOFR1,start, length);
	case oADC_JOFR2:return extract64(s->ADC_JOFR2,start, length);
	case oADC_JOFR3:return extract64(s->ADC_JOFR3,start, length);
	case oADC_JOFR4:return extract64(s->ADC_JOFR4,start, length);
	case oADC_HTR: 	return extract64(s->ADC_HTR,  start, length);
	case oADC_LTR : return extract64(s->ADC_LTR,  start, length);
	case oADC_SQR1: return extract64(s->ADC_SQR1, start, length);
	case oADC_SQR2: return extract64(s->ADC_SQR2, start, length);
	case oADC_SQR3: return extract64(s->ADC_SQR3, start, length);
	case oADC_JSQR: return extract64(s->ADC_JSQR, start, length);
	case oADC_JDR1: return extract64(s->ADC_JDR1, start, length);
	case oADC_JDR2: return extract64(s->ADC_JDR2, start, length);
	case oADC_JDR3: return extract64(s->ADC_JDR3, start, length);
	case oADC_JDR4: return extract64(s->ADC_JDR4, start, length);
	case oADC_DR  : return extract64(stm32_ADC_DR_read(s), start, length); 
        default:
		printf("jmf unknown read : %lld, size %d\n",(long long)offset,size);
            STM32_BAD_REG(offset, size);
            return 0;
    }
}

