qemu/qemu/hw/arm/stm32_adc.c
static void stm32_adc_write(void *opaque, hwaddr offset,
                       uint64_t value, unsigned size)
{
    Stm32Adc *s = (Stm32Adc *)opaque;
    
    stm32_rcc_check_periph_clk((Stm32Rcc *)s->stm32_rcc, s->periph);

    switch (offset & 0xfffffffc) {
        case oADC_SR : stm32_ADC_SR_write(s,value);break;
        case oADC_CR1: (s->ADC_CR1=value & 0x00cfffff); stm32_ADC_update_irq(s); break; //write CR1 requiere update interrupts 
        case oADC_CR2: stm32_ADC_CR2_write(s,value);break;
        case oADC_SMPR1:(s->ADC_SMPR1=value & 0x00ffffff);break;
        case oADC_SMPR2:(s->ADC_SMPR2=value & 0x3fffffff);break;
        case oADC_JOFR1:(s->ADC_JOFR1=value & 0x00000fff);break;
 	case oADC_JOFR2:(s->ADC_JOFR2=value & 0x00000fff);break;
 	case oADC_JOFR3:(s->ADC_JOFR3=value & 0x00000fff);break;
 	case oADC_JOFR4:(s->ADC_JOFR4=value & 0x00000fff);break;
	case oADC_HTR:  (s->ADC_HTR=value & 0x00000fff);break;
 	case oADC_LTR:  (s->ADC_LTR=value & 0x00000fff);break;
	case oADC_SQR1: stm32_ADC_SQR1_write(s,value);break;
	case oADC_SQR2: (s->ADC_SQR2=value & 0x3fffffff);break;
	case oADC_SQR3: (s->ADC_SQR3=value & 0x3fffffff);break;
	case oADC_JSQR: (s->ADC_JSQR=value & 0x003fffff);break;
	
        default: printf("jmf unknown write : %lld, size %d\n",(long long)offset,size);
            STM32_BAD_REG(offset, 2);
            break;
    }
}
void stm32_ADC_update_ns_per_sample(Stm32Adc *s)
{
  uint32_t clk_freq = stm32_rcc_get_periph_freq(s->stm32_rcc, s->periph);
  int i;
  //convert cycles to ns
  if(clk_freq){  
  s->ns_per_sample[0]=(1000000000LL*1.5)/clk_freq;s->ns_per_sample[1]=(1000000000LL*7.5)/clk_freq;
  s->ns_per_sample[2]=(1000000000LL*13.5)/clk_freq;s->ns_per_sample[3]=(1000000000LL*28.5)/clk_freq;
  s->ns_per_sample[4]=(1000000000LL*41.5)/clk_freq;s->ns_per_sample[5]=(1000000000LL*55.5)/clk_freq;
  s->ns_per_sample[6]=(1000000000LL*71.5)/clk_freq;s->ns_per_sample[7]=(1000000000LL*239.5)/clk_freq;
  }
  else{
  for(i=0;i<8;i++)
  s->ns_per_sample[i]=0;
  }
}
static const MemoryRegionOps stm32_adc_ops = {
    .read = stm32_adc_read,
    .write = stm32_adc_write,
    .valid.min_access_size = 2,
    .valid.max_access_size = 4,
    .endianness = DEVICE_NATIVE_ENDIAN
};



/* DEVICE INITIALIZATION */

static int stm32_adc_init(SysBusDevice *dev)
{
    qemu_irq *clk_irq;
    Stm32Adc *s = STM32_ADC(dev);
    s->stm32_rcc = (Stm32Rcc *)s->stm32_rcc_prop;
    s->stm32_gpio = (Stm32Gpio **)s->stm32_gpio_prop;
    memory_region_init_io(&s->iomem, OBJECT(s), &stm32_adc_ops, s, "adc", 0x03ff);  
        // jmf : 3FF = length, cf RM0008 p.52
    sysbus_init_mmio(dev, &s->iomem);
    sysbus_init_irq(dev, &s->irq);
    s->conv_timer = timer_new_ns(QEMU_CLOCK_VIRTUAL, (QEMUTimerCB *)stm32_adc_conv_timer_expire, s);

    /* Register handlers to handle updates to the ADC's peripheral clock. */
    clk_irq = qemu_allocate_irqs(stm32_adc_clk_irq_handler, (void *)s, 1);   // jmf : segfault
    
    stm32_rcc_set_periph_clk_irq(s->stm32_rcc, s->periph, clk_irq[0]);
    stm32_adc_reset((DeviceState *)s);
    s->Vdda=rand()%(1200+1) +2400; //Vdda belongs to the interval [2400 3600] mv
    s->Vref=rand()%(s->Vdda-2400+1) +2400; //Vref belongs to the interval [2400 Vdda] mv
    return 0;
}

static Property stm32_adc_properties[] = {
    DEFINE_PROP_PERIPH_T("periph", Stm32Adc, periph, STM32_PERIPH_UNDEFINED),
    DEFINE_PROP_PTR("stm32_rcc", Stm32Adc, stm32_rcc_prop),
    DEFINE_PROP_PTR("stm32_gpio", Stm32Adc, stm32_gpio_prop),
    DEFINE_PROP_END_OF_LIST()
};

static void stm32_adc_class_init(ObjectClass *klass, void *data)
{
    DeviceClass *dc = DEVICE_CLASS(klass);
    SysBusDeviceClass *k = SYS_BUS_DEVICE_CLASS(klass);

    k->init = stm32_adc_init;
    dc->reset = stm32_adc_reset;
    dc->props = stm32_adc_properties;
}

static TypeInfo stm32_adc_info = {
    .name  = "stm32-adc",
    .parent = TYPE_SYS_BUS_DEVICE,
    .instance_size  = sizeof(Stm32Adc),
    .class_init = stm32_adc_class_init
};

static void stm32_adc_register_types(void)
{
    type_register_static(&stm32_adc_info);
}

type_init(stm32_adc_register_types)
